sdaiCreateNestedAggrByItr(Sdai_ItrId*)
\details
Creates an aggregate instance that replaces the current member of an aggregate instance referenced by a specified iterator.
\param current [in]  An iterator that refers to the current member of the aggregate.
\returns The identifier of the newly created aggregate instance.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL -Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiIR_NEXS - Iterator does not exist.
* sdaiIR_NSET - Iterator has no current value.
* sdaiVA_NSET - Value not set.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiAB_NEXS - ADB does not exist.
* sdaiSY_ERR - Underlying system error.